Syafiqlim/ESP32_MySQL/src/ESP32_MySQL_Packet_Impl.h
/*
 * ESP32_MySQL - An optimized library for ESP32 to directly connect and execute SQL to MySQL database without intermediary.
 * 
 * Copyright (c) 2024 Syafiqlim
 * 
 * This software is released under the MIT License.
 * https://opensource.org/licenses/MIT
 */

/**************************** 
  ESP32_MySQL_Packet_Impl.h
  by Syafiqlim @ syafiqlimx
*****************************/

#pragma once

#ifndef ESP32_MYSQL_PACKET_IMPL_H
#define ESP32_MYSQL_PACKET_IMPL_H

#include <Arduino.h>

#include <ESP32_MySQL_Encrypt_Sha1.h>
#include <ESP32_MySQL_Sha256.h>

#if ( USING_WIFI_ESP_AT )
  #define ESP32_MYSQL_DATA_TIMEOUT  10000   
#else
  #define ESP32_MYSQL_DATA_TIMEOUT  6000    // Client wait in milliseconds
#endif  
//////

#define ESP32_MYSQL_WAIT_INTERVAL 300    // WiFi client wait interval
#define ESP32_MYSQL_TLS_TIMEOUT_MS 10000

/*
  Constructor

  Initialize the buffer and store client instance.
*/
MySQL_Packet::MySQL_Packet(Client *client_instance)
{
	buffer = NULL;
	server_version = NULL;
	client = client_instance;
	memset(auth_plugin, 0, sizeof(auth_plugin));
	auth_plugin_type = AUTH_MYSQL_NATIVE_PASSWORD;
	auth_plugin_data_len = 0;
	server_capabilities = 0;
  memset(seed, 0, sizeof(seed));
#if defined(ESP32)
  mbedtls_ssl_init(&tls_ctx);
  mbedtls_ssl_config_init(&tls_conf);
  mbedtls_ctr_drbg_init(&tls_ctr_drbg);
  mbedtls_entropy_init(&tls_entropy);
#endif
  memset(tls_sni_host, 0, sizeof(tls_sni_host));
  tls_requested = false;
  tls_established = false;
  ssl_request_sent = false;
  next_sequence_id = 0x01;
}

uint32_t MySQL_Packet::build_client_flags(bool use_tls) const
{
  uint32_t flags = 0x0003A60D | CLIENT_PLUGIN_AUTH;

  if (use_tls)
    flags |= CLIENT_SSL;

  return flags;
}

bool MySQL_Packet::cleanup_tls()
{
#if defined(ESP32)
  mbedtls_ssl_free(&tls_ctx);
  mbedtls_ssl_config_free(&tls_conf);
  mbedtls_ctr_drbg_free(&tls_ctr_drbg);
  mbedtls_entropy_free(&tls_entropy);
  tls_established = false;
  return true;
#else
  return false;
#endif
}

int MySQL_Packet::tls_send_cb(void *ctx, const unsigned char *buf, size_t len)
{
#if defined(ESP32)
  MySQL_Packet *self = static_cast<MySQL_Packet *>(ctx);

  if (!self || !self->client)
    return MBEDTLS_ERR_NET_SEND_FAILED;

  size_t written = self->client->write(buf, len);

  return (written > 0) ? (int) written : MBEDTLS_ERR_NET_SEND_FAILED;
#else
  (void) ctx;
  (void) buf;
  (void) len;
  return -1;
#endif
}

int MySQL_Packet::tls_recv_cb(void *ctx, unsigned char *buf, size_t len)
{
#if defined(ESP32)
  MySQL_Packet *self = static_cast<MySQL_Packet *>(ctx);

  if (!self || !self->client)
    return MBEDTLS_ERR_NET_RECV_FAILED;

  unsigned long start = millis();

  while ((self->client->available() == 0) && ((millis() - start) < ESP32_MYSQL_DATA_TIMEOUT))
  {
    delay(1);
    yield();
  }

  if (self->client->available() == 0)
    return MBEDTLS_ERR_SSL_TIMEOUT;

  int received = self->client->read(buf, len);

  if (received <= 0)
    return MBEDTLS_ERR_NET_RECV_FAILED;

  return received;
#else
  (void) ctx;
  (void) buf;
  (void) len;
  return -1;
#endif
}

int MySQL_Packet::blocking_read(unsigned char *buf, size_t len)
{
  if (!client)
    return -1;

  size_t offset = 0;
  unsigned long start = millis();

  while ((offset < len) && ((millis() - start) < ESP32_MYSQL_DATA_TIMEOUT))
  {
    int avail = client->available();

    if (avail > 0)
    {
      int read_now = client->read(buf + offset, len - offset);

      if (read_now > 0)
        offset += read_now;
    }
    else
    {
      delay(1);
      yield();
    }
  }

  return offset;
}

int MySQL_Packet::blocking_read_tls(unsigned char *buf, size_t len)
{
#if defined(ESP32)
  size_t offset = 0;
  unsigned long start = millis();

  while ((offset < len) && ((millis() - start) < ESP32_MYSQL_DATA_TIMEOUT))
  {
    int ret = mbedtls_ssl_read(&tls_ctx, buf + offset, len - offset);

    if (ret > 0)
    {
      offset += ret;
    }
    else if ((ret == MBEDTLS_ERR_SSL_WANT_READ) || (ret == MBEDTLS_ERR_SSL_WANT_WRITE))
    {
      delay(1);
      yield();
      continue;
    }
    else
    {
      return ret;
    }
  }

  return offset;
#else
  (void) buf;
  (void) len;
  return -1;
#endif
}

int MySQL_Packet::blocking_write_tls(const unsigned char *buf, size_t len)
{
#if defined(ESP32)
  size_t offset = 0;
  unsigned long start = millis();

  while ((offset < len) && ((millis() - start) < ESP32_MYSQL_DATA_TIMEOUT))
  {
    int ret = mbedtls_ssl_write(&tls_ctx, buf + offset, len - offset);

    if (ret > 0)
    {
      offset += ret;
    }
    else if ((ret == MBEDTLS_ERR_SSL_WANT_READ) || (ret == MBEDTLS_ERR_SSL_WANT_WRITE))
    {
      delay(1);
      yield();
      continue;
    }
    else
    {
      return ret;
    }
  }

  return offset;
#else
  (void) buf;
  (void) len;
  return -1;
#endif
}

bool MySQL_Packet::write_bytes(const uint8_t *data, size_t len)
{
  if (!client || (data == NULL))
    return false;

  if (tls_established)
  {
    int ret = blocking_write_tls(data, len);
    return ret == (int) len;
  }

  size_t written = client->write(data, len);

  return written == len;
}

bool MySQL_Packet::read_bytes(uint8_t *out, size_t len)
{
  if (!client || (out == NULL))
    return false;

  int ret = tls_established ? blocking_read_tls(out, len) : blocking_read(out, len);

  return ret == (int) len;
}

bool MySQL_Packet::send_ssl_request(uint32_t client_flags, uint8_t sequence_id)
{
  // SSL Request packet: header (4 bytes) + payload (32 bytes)
  uint8_t packet[4 + 32];
  size_t offset = 0;

  // Packet length (payload only)
  store_int(packet, 32, 3);
  packet[3] = sequence_id;
  offset = 4;

  store_int(&packet[offset], client_flags | CLIENT_SSL, 4);
  offset += 4;

  // max_allowed_packet (little endian). Keep minimal 1MB default style (0x01000000).
  packet[offset + 0] = 0x00;
  packet[offset + 1] = 0x00;
  packet[offset + 2] = 0x00;
  packet[offset + 3] = 0x01;
  offset += 4;

  // charset - default 8 (latin1)
  packet[offset++] = byte(0x08);

  // filler
  for (int i = 0; i < 23; i++)
    packet[offset + i] = 0x00;

  offset += 23;

  ssl_request_sent = write_bytes(packet, offset);

  if (ssl_request_sent)
    next_sequence_id = sequence_id + 1;

  return ssl_request_sent;
}

bool MySQL_Packet::start_tls_handshake()
{
#if defined(ESP32)
  cleanup_tls();

  mbedtls_ssl_init(&tls_ctx);
  mbedtls_ssl_config_init(&tls_conf);
  mbedtls_ctr_drbg_init(&tls_ctr_drbg);
  mbedtls_entropy_init(&tls_entropy);

  const char *pers = "esp32_mysql_tls";
  int ret = mbedtls_ctr_drbg_seed(&tls_ctr_drbg, mbedtls_entropy_func, &tls_entropy, (const unsigned char *) pers, strlen(pers));

  if (ret != 0)
  {
    ESP32_MYSQL_LOGERROR1("TLS seed failed, code =", ret);
    return false;
  }

