Syafiqlim/ESP32_MySQL/src/ESP32_MySQL_Packet_Impl.h
  ret = mbedtls_ssl_config_defaults(&tls_conf,
                                    MBEDTLS_SSL_IS_CLIENT,
                                    MBEDTLS_SSL_TRANSPORT_STREAM,
                                    MBEDTLS_SSL_PRESET_DEFAULT);

  if (ret != 0)
  {
    ESP32_MYSQL_LOGERROR1("TLS config defaults failed, code =", ret);
    return false;
  }

  mbedtls_ssl_conf_authmode(&tls_conf, MBEDTLS_SSL_VERIFY_NONE);
  mbedtls_ssl_conf_rng(&tls_conf, mbedtls_ctr_drbg_random, &tls_ctr_drbg);

  ret = mbedtls_ssl_setup(&tls_ctx, &tls_conf);

  if (ret != 0)
  {
    ESP32_MYSQL_LOGERROR1("TLS setup failed, code =", ret);
    return false;
  }

  if (tls_sni_host[0] != 0)
    mbedtls_ssl_set_hostname(&tls_ctx, tls_sni_host);

  mbedtls_ssl_set_bio(&tls_ctx, this, tls_send_cb, tls_recv_cb, NULL);

  unsigned long start = millis();

  while ((ret = mbedtls_ssl_handshake(&tls_ctx)) != 0)
  {
    if ((ret != MBEDTLS_ERR_SSL_WANT_READ) && (ret != MBEDTLS_ERR_SSL_WANT_WRITE))
    {
      ESP32_MYSQL_LOGERROR1("TLS handshake failed, code =", ret);
      cleanup_tls();
      return false;
    }

    if ((millis() - start) > ESP32_MYSQL_TLS_TIMEOUT_MS)
    {
      ESP32_MYSQL_LOGERROR("TLS handshake timeout");
      cleanup_tls();
      return false;
    }

    delay(1);
    yield();
  }

  tls_established = true;
  return true;
#else
  ESP32_MYSQL_LOGERROR("TLS not supported on this platform");
  return false;
#endif
}

bool MySQL_Packet::encrypt_password_rsa(const uint8_t *pubkey, size_t pubkey_len, const char *password,
                                        uint8_t *encrypted, size_t *encrypted_len)
{
#if defined(ESP32)
  if (!pubkey || (pubkey_len == 0) || !password || !encrypted || !encrypted_len)
    return false;

  const size_t pw_len = strlen(password) + 1; // include terminating null

  uint8_t *plain = (uint8_t *) malloc(pw_len);

  if (!plain)
    return false;

  for (size_t i = 0; i < pw_len; i++)
    plain[i] = ((uint8_t) password[i]) ^ seed[i % 20];

  bool ok = false;
  int ret = 0;
  size_t rsa_len = 0;
  mbedtls_rsa_context *rsa = NULL;

  mbedtls_pk_context pk;
  mbedtls_ctr_drbg_context ctr_drbg;
  mbedtls_entropy_context entropy;

  mbedtls_pk_init(&pk);
  mbedtls_ctr_drbg_init(&ctr_drbg);
  mbedtls_entropy_init(&entropy);

  const char *pers = "esp32_mysql_rsa";
  ret = mbedtls_ctr_drbg_seed(&ctr_drbg, mbedtls_entropy_func, &entropy, (const unsigned char *) pers, strlen(pers));

  if (ret != 0)
  {
    ESP32_MYSQL_LOGERROR1("RSA seed failed, code =", ret);
    goto cleanup_labels;
  }

  ret = mbedtls_pk_parse_public_key(&pk, pubkey, pubkey_len);

  if (ret != 0)
  {
    ESP32_MYSQL_LOGERROR1("Parse RSA public key failed, code =", ret);
    goto cleanup_labels;
  }

  if (!mbedtls_pk_can_do(&pk, MBEDTLS_PK_RSA))
  {
    ESP32_MYSQL_LOGERROR("Public key is not RSA");
    ret = -1;
    goto cleanup_labels;
  }

  rsa = mbedtls_pk_rsa(pk);
  mbedtls_rsa_set_padding(rsa, MBEDTLS_RSA_PKCS_V21, MBEDTLS_MD_SHA1);

  rsa_len = mbedtls_pk_get_len(&pk);

  if (rsa_len == 0)
  {
    ESP32_MYSQL_LOGERROR("Invalid RSA modulus length");
    ret = -1;
    goto cleanup_labels;
  }

  ret = mbedtls_pk_encrypt(&pk,
                           plain,
                           pw_len,
                           encrypted,
                           encrypted_len,
                           rsa_len,
                           mbedtls_ctr_drbg_random,
                           &ctr_drbg);

  if (ret != 0)
  {
    ESP32_MYSQL_LOGERROR1("RSA encrypt failed, code =", ret);
    goto cleanup_labels;
  }
  ok = true;

cleanup_labels:
  mbedtls_pk_free(&pk);
  mbedtls_ctr_drbg_free(&ctr_drbg);
  mbedtls_entropy_free(&entropy);
  free(plain);

  return ok && (ret == 0);
#else
  (void) pubkey;
  (void) pubkey_len;
  (void) password;
  (void) encrypted;
  (void) encrypted_len;
  return false;
#endif
}

/*
  send_authentication_packet

  This method builds a response packet used to respond to the server's
  challenge packet (called the handshake packet). It includes the user
  name and password scrambled using the SHA1 seed from the handshake
  packet. It also sets the character set (default is 8 which you can
  change to meet your needs).

  Note: you can also set the default database in this packet. See
        the code before for a comment on where this happens.

  The authentication packet is defined as follows.

  Bytes                        Name
  -----                        ----
  4                            client_flags
  4                            max_packet_size
  1                            charset_number
  23                           (filler) always 0x00...
  n (Null-Terminated String)   user
  n (Length Coded Binary)      scramble_buff (1 + x bytes)
  n (Null-Terminated String)   databasename (optional)

  user[in]        User name
  password[in]    password
  db[in]          default database
*/

void MySQL_Packet::send_authentication_packet(char *user, char *password, char *db, uint32_t client_flags, uint8_t sequence_id)
{ 
  byte this_buffer[256];
  byte scramble[SHA256_HASH_SIZE];

  int size_send = 4;

  if (client_flags == 0)
  {
    const bool use_tls = tls_established || ssl_request_sent || tls_requested;
    client_flags = build_client_flags(use_tls);
  }

  store_int(&this_buffer[size_send], client_flags, 4);
  size_send += 4;

  // max_allowed_packet
  this_buffer[size_send] = 0;
  this_buffer[size_send + 1] = 0;
  this_buffer[size_send + 2] = 0;
  this_buffer[size_send + 3] = 1;
  size_send += 4;

  // charset - default is 8
  this_buffer[size_send] = byte(0x08);
  size_send += 1;

  for (int i = 0; i < 23; i++)
    this_buffer[size_send + i] = 0x00;

  size_send += 23;

  // user name
  memcpy((char *) &this_buffer[size_send], user, strlen(user));
  size_send += strlen(user) + 1;
  this_buffer[size_send - 1] = 0x00;

  AuthPlugin plugin = (auth_plugin_type == AUTH_UNKNOWN) ? AUTH_MYSQL_NATIVE_PASSWORD : auth_plugin_type;
  bool has_scramble = false;
  uint8_t scramble_len = 0;

  if (plugin == AUTH_CACHING_SHA2_PASSWORD)
  {
    has_scramble = scramble_password_caching_sha2(password, scramble);
    scramble_len = SHA256_HASH_SIZE;
  }
  else if (plugin == AUTH_SHA256_PASSWORD)
  {
    has_scramble = scramble_password_sha256(password, scramble);
    scramble_len = SHA256_HASH_SIZE;
  }
  else
  {
    has_scramble = scramble_password(password, scramble);
    scramble_len = 20;
  }

  if (has_scramble)
  {
    this_buffer[size_send] = scramble_len;
    size_send += 1;

