Syafiqlim/ESP32_MySQL/src/ESP32_MySQL_Packet_Impl.h
    for (uint8_t i = 0; i < scramble_len; i++)
      this_buffer[i + size_send] = scramble[i];

    size_send += scramble_len;
  }
  else
  {
    this_buffer[size_send] = 0x00;
    size_send += 1;
  }

  if (db)
  {
    memcpy((char *) &this_buffer[size_send], db, strlen(db));
    size_send += strlen(db) + 1;
    this_buffer[size_send - 1] = 0x00;
  }
  else
  {
    this_buffer[size_send] = 0x00;
    size_send += 1;
  }

  // Authentication plugin name (makes the server honor our scramble choice)
  const char *plugin_name = (auth_plugin[0] != 0) ? auth_plugin : "mysql_native_password";
  const size_t plugin_len = strlen(plugin_name);

  memcpy(&this_buffer[size_send], plugin_name, plugin_len + 1);
  size_send += plugin_len + 1;

  // Write packet size
  int p_size = size_send - 4;
  store_int(&this_buffer[0], p_size, 3);
  this_buffer[3] = sequence_id;

  next_sequence_id = sequence_id + 1;

  // Write the packet
  ESP32_MYSQL_LOGINFO1("Writing authentication packet, size =", size_send);

  write_bytes((uint8_t*)this_buffer, size_send);
}

bool MySQL_Packet::handle_auth_switch_request()
{
  if (!buffer || (packet_len < 2) || (buffer[4] != ESP32_MYSQL_EOF_PACKET))
    return false;

  const size_t payload_start = 4;
  const size_t payload_end = payload_start + packet_len;
  size_t pos = payload_start + 1; // skip 0xFE marker

  if (pos >= payload_end)
    return false;

  const size_t plugin_start = pos;

  while ((pos < payload_end) && (buffer[pos] != 0x00))
    pos++;

  const size_t plugin_len = (pos > plugin_start) ? min((size_t) (sizeof(auth_plugin) - 1), pos - plugin_start) : 0;

  if (plugin_len == 0)
  {
    ESP32_MYSQL_LOGERROR("AuthSwitchRequest missing plugin name");
    return false;
  }

  memcpy(auth_plugin, &buffer[plugin_start], plugin_len);
  auth_plugin[plugin_len] = 0;
  auth_plugin_type = plugin_from_name(auth_plugin);

  // Skip null terminator and copy new scramble/seed data when present.
  if ((pos < payload_end) && (buffer[pos] == 0x00))
    pos++;

  memset(seed, 0, sizeof(seed));

  if (pos < payload_end)
  {
    size_t seed_len = payload_end - pos;

    // Some servers include a trailing NUL byte in auth plugin data.
    if ((seed_len > 0) && (buffer[payload_end - 1] == 0x00))
      seed_len--;

    const size_t copy_len = min(seed_len, sizeof(seed));

    if (copy_len > 0)
      memcpy(seed, &buffer[pos], copy_len);
  }

  ESP32_MYSQL_LOGINFO1("AuthSwitchRequest plugin:", auth_plugin);
  return true;
}

bool MySQL_Packet::send_auth_switch_response()
{
  const char *pwd = get_cached_password();

  if (!pwd)
  {
    ESP32_MYSQL_LOGERROR("Missing cached password for AuthSwitchResponse");
    return false;
  }

  byte scramble[SHA256_HASH_SIZE];
  memset(scramble, 0, sizeof(scramble));

  const AuthPlugin plugin = (auth_plugin_type == AUTH_UNKNOWN) ? AUTH_MYSQL_NATIVE_PASSWORD : auth_plugin_type;
  bool has_scramble = false;
  uint8_t scramble_len = 0;

  if (plugin == AUTH_CACHING_SHA2_PASSWORD)
  {
    has_scramble = scramble_password_caching_sha2((char *) pwd, scramble);
    scramble_len = SHA256_HASH_SIZE;
  }
  else if (plugin == AUTH_SHA256_PASSWORD)
  {
    has_scramble = scramble_password_sha256((char *) pwd, scramble);
    scramble_len = SHA256_HASH_SIZE;
  }
  else
  {
    has_scramble = scramble_password((char *) pwd, scramble);
    scramble_len = 20;
  }

  const size_t payload_len = has_scramble ? scramble_len : 0;
  const size_t packet_len_out = payload_len + 4;
  uint8_t *packet = (uint8_t *) malloc(packet_len_out);

  if (!packet)
  {
    ESP32_MYSQL_LOGERROR("Failed to allocate AuthSwitchResponse packet");
    return false;
  }

  store_int(packet, payload_len, 3);
  const uint8_t response_seq = buffer ? (uint8_t) (buffer[3] + 1) : get_next_sequence_id();
  packet[3] = response_seq;

  if (payload_len > 0)
    memcpy(packet + 4, scramble, payload_len);

  const bool wrote = write_bytes(packet, packet_len_out);
  set_next_sequence_id(response_seq + 1);
  free(packet);

  if (!wrote)
  {
    ESP32_MYSQL_LOGERROR("Failed to send AuthSwitchResponse");
    return false;
  }

  return true;
}

/*
  scramble_password - Build a SHA1 scramble of the user password

  This method uses the password hash seed sent from the server to
  form a SHA1 hash of the password. This is used to send back to
  the server to complete the challenge and response step in the
  authentication handshake.

  password[in]    User's password in clear text
  pwd_hash[in]    Seed from the server

  Returns bool - True = scramble succeeded
*/
bool MySQL_Packet::scramble_password(char *password, byte *pwd_hash) 
{
  byte *digest;
  byte hash1[20];
  byte hash2[20];
  byte hash3[20];
  byte pwd_buffer[40];

  if (strlen(password) == 0)
    return false;

  // hash1
  Sha1.init();
  Sha1.print(password);
  digest = Sha1.result();
  memcpy(hash1, digest, 20);

  // hash2
  Sha1.init();
  Sha1.write(hash1, 20);
  digest = Sha1.result();
  memcpy(hash2, digest, 20);

  // hash3 of seed + hash2
  Sha1.init();
  memcpy(pwd_buffer, &seed, 20);
  memcpy(pwd_buffer + 20, hash2, 20);
  Sha1.write(pwd_buffer, 40);
  digest = Sha1.result();
  memcpy(hash3, digest, 20);

  // XOR for hash4
  for (int i = 0; i < 20; i++)
    pwd_hash[i] = hash1[i] ^ hash3[i];

  return true;
}

bool MySQL_Packet::scramble_password_caching_sha2(char *password, byte *pwd_hash)
{
  if (!password || (strlen(password) == 0))
    return false;

  uint8_t hash1[SHA256_HASH_SIZE];
  uint8_t hash2[SHA256_HASH_SIZE];
  uint8_t hash3[SHA256_HASH_SIZE];

  ESP32_MySQL_SHA256 sha256;
  sha256.update((uint8_t *) password, strlen(password));
  sha256.final(hash1);

  ESP32_MySQL_SHA256 sha256_second;
  sha256_second.update(hash1, SHA256_HASH_SIZE);
  sha256_second.final(hash2);

  ESP32_MySQL_SHA256 sha256_third;
  sha256_third.update(hash2, SHA256_HASH_SIZE);
  sha256_third.update(seed, 20);
  sha256_third.final(hash3);

  for (int i = 0; i < SHA256_HASH_SIZE; i++)
    pwd_hash[i] = hash1[i] ^ hash3[i];

  return true;
}

bool MySQL_Packet::scramble_password_sha256(char *password, byte *pwd_hash)
{
  // sha256_password requires the same scramble as caching_sha2_password for the fast auth path.
  return scramble_password_caching_sha2(password, pwd_hash);
}

