Syafiqlim/ESP32_MySQL/src/ESP32_MySQL_Packet_Impl.h
    //client->stop();
  }

  ESP32_MYSQL_LOGDEBUG1("MySQL_Packet::wait_for_bytes: OK, Num bytes= ", num);
  //////

  return num;
}

/*
  read_packet - Read a packet from the server and store it in the buffer

  This method reads the bytes sent by the server as a packet. All packets
  have a packet header defined as follows.

  Bytes                 Name
  -----                 ----
  3                     Packet Length
  1                     Packet Number

  Thus, the length of the packet (not including the packet header) can
  be found by reading the first 4 bytes from the server then reading
  N bytes for the packet payload.
*/

// TODO: Pass buffer pointer instead of using global buffer

bool MySQL_Packet::read_packet()
{
  #define PACKET_HEADER_SZ      4
  
  byte local[PACKET_HEADER_SZ];
  
  ESP32_MYSQL_LOGLEVEL5("MySQL_Packet::read_packet: step 1");
  
  if ( largest_buffer_size > 0 )
    memset(buffer, 0, largest_buffer_size);

  // Read packet header
  if (!read_bytes(local, PACKET_HEADER_SZ))
  {
    packet_len = 0;
    ESP32_MYSQL_LOGINFO1("MySQL_Packet::read_packet: ", READ_TIMEOUT);
    
    return false;
  }

  ESP32_MYSQL_LOGLEVEL5("MySQL_Packet::read_packet: step 2");

  packet_len = 0;

  // Get packet length
  packet_len = local[0];
  packet_len += (local[1] << 8);
  packet_len += ((uint32_t)local[2] << 16);

  // We must wait for slow arriving packets for Ethernet shields only.
  /*
    if (wait_for_bytes(packet_len) < packet_len) 
    {
      ESP32_MYSQL_LOGERROR(READ_TIMEOUT);
      return false;
    }
  */

  ESP32_MYSQL_LOGINFO1("MySQL_Packet::read_packet: packet_len= ", packet_len);

  // Check for valid packet.
  if ( (packet_len < 0) || ( packet_len > MAX_TRANSMISSION_UNIT ) )
  {
    ESP32_MYSQL_LOGERROR(PACKET_ERROR);
    packet_len = 0;
    
    return false;
  }

  if ( largest_buffer_size < packet_len + PACKET_HEADER_SZ )
  {
    if (largest_buffer_size == 0 )
    {
      // Check if we need to allocate buffer the first time
      largest_buffer_size = packet_len + PACKET_HEADER_SZ;
      ESP32_MYSQL_LOGINFO1("MySQL_Packet::read_packet: First time allocate buffer, size = ", largest_buffer_size);
      
      buffer = (byte *) malloc(largest_buffer_size);
    }
    else
    {
      // Check if we need to reallocate buffer
      largest_buffer_size = packet_len + PACKET_HEADER_SZ;
      ESP32_MYSQL_LOGINFO1("MySQL_Packet::read_packet: Reallocate buffer, size = ", largest_buffer_size);
      
      buffer = (byte *) realloc(buffer, largest_buffer_size);
    }
  }
  
  if (buffer == NULL)
  {
    ESP32_MYSQL_LOGERROR("MySQL_Packet::read_packet: NULL buffer");
    largest_buffer_size = 0;
    
    return false;
  }
  else
  {
    memset(buffer, 0, largest_buffer_size);
  }

  memcpy(buffer, local, PACKET_HEADER_SZ);

  if (packet_len > 0)
  {
    if (!read_bytes(buffer + PACKET_HEADER_SZ, packet_len))
    {
      ESP32_MYSQL_LOGERROR("MySQL_Packet::read_packet: failed reading payload");
      return false;
    }
  }

  ESP32_MYSQL_LOGDEBUG("MySQL_Packet::read_packet: exit");
  
  return true;
}


/*
  parse_handshake_packet - Decipher the server's challenge data

  This method reads the server version string and the seed from the
  server. The handshake packet is defined as follows.

   Bytes                        Name
   -----                        ----
   1                            protocol_version
   n (Null-Terminated String)   server_version
   4                            thread_id
   8                            scramble_buff
   1                            (filler) always 0x00
   2                            server_capabilities
   1                            server_language
   2                            server_status
   2                            server capabilities (two upper bytes)
   1                            length of the scramble seed
  10                            (filler)  always 0
   n                            rest of the plugin provided data
                                (at least 12 bytes)
   1                            \0 byte, terminating the second part of
                                 a scramble seed
*/

void MySQL_Packet::parse_handshake_packet()
{
  if (!buffer)
  {
    ESP32_MYSQL_LOGERROR("MySQL_Packet::parse_handshake_packet: NULL buffer");
    return;
  }

  // Reset state from any previous handshake
  memset(seed, 0, sizeof(seed));
  memset(auth_plugin, 0, sizeof(auth_plugin));
  auth_plugin_type = AUTH_MYSQL_NATIVE_PASSWORD;
  auth_plugin_data_len = 0;
  server_capabilities = 0;

  // Payload starts after the 4-byte packet header
  size_t offset = 4;
  const size_t end = packet_len + 4;

  if (offset >= end)
    return;

  // Skip protocol version
  offset++;

  // Read server version string (null-terminated)
  size_t version_start = offset;

  while ((offset < end) && (buffer[offset] != 0x00))
    offset++;

  if (offset > version_start)
  {
    size_t ver_len = offset - version_start;

    if (server_version)
    {
      free(server_version);
      server_version = NULL;
    }

    server_version = (char *) malloc(ver_len + 1);

    if (server_version)
    {
      memcpy(server_version, &buffer[version_start], ver_len);
      server_version[ver_len] = 0;
    }
  }

  // Skip the null terminator
  offset++;

  if (offset + 4 > end)
    return;

  // Thread id
  offset += 4;

  // Scramble part 1 (8 bytes)
  for (int j = 0; (j < 8) && (offset + j < end); j++)
  {
    seed[j] = buffer[offset + j];
  }

  offset += 8;

  // Filler
  offset++;

  if (offset + 2 > end)
    return;

  server_capabilities = buffer[offset] | (buffer[offset + 1] << 8);
  offset += 2;

  // Charset
  offset++;

  // Status flags
  offset += 2;

  if (offset + 2 > end)
    return;

  server_capabilities |= ((uint32_t) (buffer[offset] | (buffer[offset + 1] << 8))) << 16;
  offset += 2;

  if (offset < end)
  {
    auth_plugin_data_len = buffer[offset];
    offset++;
  }

  // Reserved bytes
  offset += 10;

  size_t second_seed_len = (auth_plugin_data_len > 0) ? max((int) auth_plugin_data_len - 8, 12) : 12;
  const size_t available_seed_bytes = (offset < end) ? min(second_seed_len, end - offset) : 0;

  for (size_t j = 0; (j < 12) && (j < available_seed_bytes); j++)
  {
    seed[j + 8] = buffer[offset + j];
  }

  offset += available_seed_bytes;

  if (offset < end)
  {
    size_t plugin_start = offset;

    while ((offset < end) && (buffer[offset] != 0x00))
      offset++;

    size_t plugin_len = (offset > plugin_start) ? min((size_t) (sizeof(auth_plugin) - 1), offset - plugin_start) : 0;

    if (plugin_len > 0)
    {
      memcpy(auth_plugin, &buffer[plugin_start], plugin_len);
      auth_plugin[plugin_len] = 0;
    }
  }

  if (auth_plugin[0] == 0)
  {
    strncpy(auth_plugin, "mysql_native_password", sizeof(auth_plugin) - 1);
    auth_plugin[sizeof(auth_plugin) - 1] = 0;
  }

  auth_plugin_type = plugin_from_name(auth_plugin);
  ESP32_MYSQL_LOGINFO1("Auth plugin from server:", auth_plugin);
}

