Syafiqlim/ESP32_MySQL/src/ESP32_MySQL_Packet_Impl.h
/*
  parse_error_packet - Display the error returned from the server

  This method parses an error packet from the server and displays the
  error code and text via Serial.print. The error packet is defined
  as follows.

  Note: the error packet is already stored in the buffer since this
        packet is not an expected response.

  Bytes                       Name
  -----                       ----
  1                           field_count, always = 0xff
  2                           errno
  1                           (sqlstate marker), always '#'
  5                           sqlstate (5 characters)
  n                           message
*/

void MySQL_Packet::parse_error_packet() 
{
  ESP32_MYSQL_LOGDEBUG2("Error: ", read_int(5, 2), " = ");

  if (!buffer)
  {
    ESP32_MYSQL_LOGERROR("MySQL_Packet::parse_error_packet: NULL buffer");
    return;
  }

  for (int i = 0; i < packet_len - 9; i++)
  {
    ESP32_MYSQL_LOGDEBUG0((char)buffer[i + 13]);
  }
    
  ESP32_MYSQL_LOGDEBUG0LN(".");
}

AuthPlugin MySQL_Packet::plugin_from_name(const char *name) const
{
  if (!name || (strlen(name) == 0))
    return AUTH_UNKNOWN;

  if (strcmp(name, "mysql_native_password") == 0)
    return AUTH_MYSQL_NATIVE_PASSWORD;

  if (strcmp(name, "caching_sha2_password") == 0)
    return AUTH_CACHING_SHA2_PASSWORD;

  if (strcmp(name, "sha256_password") == 0)
    return AUTH_SHA256_PASSWORD;

  return AUTH_UNKNOWN;
}


/*
  get_packet_type - Returns the packet type received from the server.

   Bytes                       Name
   -----                       ----
   1   (Length Coded Binary)   field_count, always = 0
   1-9 (Length Coded Binary)   affected_rows
   1-9 (Length Coded Binary)   insert_id
   2                           server_status
   2                           warning_count
   n   (until end of packet)   message

  Returns integer - 0 = successful parse, packet type if not an Ok packet
*/

int MySQL_Packet::get_packet_type() 
{
  if (!buffer)
  {
    ESP32_MYSQL_LOGERROR("MySQL_Packet::get_packet_type: NULL buffer");
    return -1;
  }

  int type = buffer[4];
  
  ESP32_MYSQL_LOGDEBUG1("MySQL_Packet::get_packet_type: packet type= ", type);

  if (type == ESP32_MYSQL_OK_PACKET)
  {
    ESP32_MYSQL_LOGDEBUG("MySQL_Packet::get_packet_type: packet type= ESP32_MYSQL_OK_PACKET");
  }
  else if (type == ESP32_MYSQL_EOF_PACKET)
  {
    ESP32_MYSQL_LOGDEBUG("MySQL_Packet::get_packet_type: packet type= ESP32_MYSQL_EOF_PACKET");
  }
  else if (type == ESP32_MYSQL_ERROR_PACKET)
  {
    ESP32_MYSQL_LOGDEBUG("MySQL_Packet::get_packet_type: packet type= ESP32_MYSQL_ERROR_PACKET");
  }
  else
  {
    ESP32_MYSQL_LOGDEBUG("MySQL_Packet::get_packet_type: Packet Type Error");
  }

  return type;
}


/*
  get_lcb_len - Retrieves the length of a length coded binary value

  This reads the first byte from the offset into the buffer and returns
  the number of bytes (size) that the integer consumes. It is used in
  conjunction with read_int() to read length coded binary integers
  from the buffer.

  Returns integer - number of bytes integer consumes
*/

int MySQL_Packet::get_lcb_len(const int& offset) 
{
  if (!buffer)
  {
    ESP32_MYSQL_LOGERROR("MySQL_Packet::get_lcb_len: NULL buffer");
    return 0;
  }

  int read_len = buffer[offset];
  
  if (read_len > 250) 
  {
    // read type:
    byte type = buffer[offset + 1];
    
    if (type == 0xfc)
      read_len = 2;
    else if (type == 0xfd)
      read_len = 3;
    else if (type == 0xfe)
      read_len = 8;
  } 
  else 
  {
    read_len = 1;
  }

  ESP32_MYSQL_LOGDEBUG1("MySQL_Packet::get_lcb_len: read_len= ", read_len);

  return read_len;
}

/*
  read_int - Retrieve an integer from the buffer in size bytes.

  This reads an integer from the buffer at offset position indicated for
  the number of bytes specified (size).

  offset[in]      offset from start of buffer
  size[in]        number of bytes to use to store the integer

  Returns integer - integer from the buffer
*/

int MySQL_Packet::read_int(const int& offset, const int& size) 
{
  int value = 0;
  int new_size = 0;
  
  if (!buffer)
  {
    ESP32_MYSQL_LOGERROR("MySQL_Packet::read_int: NULL buffer");
    return -1;
  }
    
  if (size == 0)
    new_size = get_lcb_len(offset);
    
  if (size == 1)
    return buffer[offset];
    
  new_size = size;
  int shifter = (new_size - 1) * 8;
  
  for (int i = new_size; i > 0; i--) 
  {
    value += (buffer[i - 1] << shifter);
    shifter -= 8;
  }
  
  return value;
}


/*
  store_int - Store an integer value into a byte array of size bytes.

  This writes an integer into the buffer at the current position of the
  buffer. It will transform an integer of size to a length coded binary
  form where 1-3 bytes are used to store the value (set by size).

  buff[in]        pointer to location in internal buffer where the
                  integer will be stored
  value[in]       integer value to be stored
  size[in]        number of bytes to use to store the integer
*/
void MySQL_Packet::store_int(byte *buff, const long& value, const int& size) 
{
  if (!buff)
  {
    ESP32_MYSQL_LOGERROR("MySQL_Packet::store_int: NULL buffer");
    return;
  }

  memset(buff, 0, size);
  
  if (value <= 0xff)
    buff[0] = (byte)value;
  else if (value <= 0xffff) 
  {
    buff[0] = (byte)value;
    buff[1] = (byte)(value >> 8);
  } 
  else if (value <= 0xffffff) 
  {
    buff[0] = (byte)value;
    buff[1] = (byte)(value >> 8);
    buff[2] = (byte)(value >> 16);
  } 
  else if (value > 0xffffff) 
  {
    buff[0] = (byte)value;
    buff[1] = (byte)(value >> 8);
    buff[2] = (byte)(value >> 16);
    buff[3] = (byte)(value >> 24);
  }
}

/*
  read_lcb_int - Read an integer with len encoded byte

  This reads an integer from the buffer looking at the first byte in the offset
  as the encoded length of the integer.

  offset[in]      offset from start of buffer

  Returns integer - integer from the buffer
*/

int MySQL_Packet::read_lcb_int(const int& offset) 
{
  int len_size = 0;
  int value = 0;
  
  if (!buffer)
  {
    ESP32_MYSQL_LOGERROR("MySQL_Packet::read_lcb_int: NULL buffer");
    return -1;
  }
    
  len_size = buffer[offset];
  
  if (len_size < 252) 
  {
    return buffer[offset];
  } 
  else if (len_size == 252) 
  {
    len_size = 2;
  } 
  else if (len_size == 253) 
  {
    len_size = 3;
  } 
  else 
  {
    len_size = 8;
  }
  
  int shifter = (len_size - 1) * 8;
  
  for (int i = len_size; i > 0; i--) 
  {
    value += (buffer[offset + i] << shifter);
    shifter -= 8;
  }
  
  return value;
}

/*
  print_packet - Print the contents of a packet via Serial.print

  This method is a diagnostic method. It is best used to decipher a
  packet from the server (or before being sent to the server). If you
  are looking for additional program memory space, you can safely
  delete this method.
*/

void MySQL_Packet::print_packet() 
{
  if (!buffer)
  {
    ESP32_MYSQL_LOGERROR("MySQL_Packet::print_packet: NULL buffer");
    return;
  }

  ESP32_MYSQL_LOGDEBUG3("Packet: ", buffer[3], " contains no. bytes = ", packet_len + 3);

  ESP32_MYSQL_LOGDEBUG0("  HEX: ");
  
  for (int i = 0; i < packet_len + 3; i++) 
  {
    ESP32_MYSQL_LOGDEBUG0(String(buffer[i], HEX));
    ESP32_MYSQL_LOGDEBUG0(" ");
  }
  
  ESP32_MYSQL_LOGDEBUG0LN("");
  
  ESP32_MYSQL_LOGDEBUG0("ASCII: ");
  
  for (int i = 0; i < packet_len + 3; i++)
    ESP32_MYSQL_LOGDEBUG0((char)buffer[i]);
    
  ESP32_MYSQL_LOGDEBUG0LN("");
}

#endif    // ESP32_MYSQL_PACKET_IMPL_H
